# -*- coding:utf-8 -*-
from doctest import testfile
import random
import string
import radar
import csv

#小区ID列表
community_ID_list = [
    '1111','1112','1113','1114','1115','1126','1127','1211','1212','1213','1214','1215','1226','1227','1311','1312','1313',
    '1314','1315','1326','1327','1411','1412','1413','1414','1415','1426','1427','1511','1512','1513','1514','1515','1526','1527','1611','1612',
    '1613','1614','1615','1626','1627','1711','1712','1713','1714','1715','1726','1727','1811','1812','1813','1814','1815','1826','1827','1911',
    '1912','1913','1914','1915','1926','1927','2111','2112','2113','2114','2115','2126','2127','2211','2212','2213','2214','2215','2226','2227',
    '2311','2312','2313','2314','2315','2326','2327','2411','2412','2413','2414','2415','2426','2427','2511','2512','2513','2514','2515','2526',
    '2527','2611','2612','2613','2614','2615','2626','2627','2711','2712','2713','2714','2715','2726','2727','2811','2812','2813','2814','2815',
    '2826','2827','2911','2912','2913','2914','2915','2926','2927','3111','3112','3113','3114','3115','3126','3127','3211','3212','3213','3214',
    '3215','3226','3227','3311','3312','3313','3314','3315','3326','3327']
#小区列表
community_list=[
    "巷上嘉园","中轴国际","中景濠庭","中涤胡同甲2号院","凯景铭座","北锣鼓巷","宝钞苑","花园胡同","华府景园","湖景苑",
    "西水井胡同","朝阳首府","芳草苑公寓","东营房八条","迪阳公寓","东环广场","正东国际大厦","元嘉国际公寓","西香河园","新中西里",
    "雅宝里社区","怡景园","京华豪园","蓝筹名座","日坛国际贸易中心","东方银座","民安小区","北新桥头条","察慈小区","榆树馆西里",
    "郝家湾","进步巷","九和苑","锦官苑","五栋大楼","团结大院","铁路巷","京桥国际公馆","德宝新园","交大嘉园",
    "广通苑","东桃园","卫生部小区","熙府桃园","新兴东巷","玉桃园","交大畅园","铁道科学研究院","舒至嘉园","知春嘉园",
    "盈华盛嘉","地藏庵","南营房","南沙沟小区","巴黎公寓","太月园","学院国际大厦","锦秋知春","金谷园","罗庄东里",
    "北航家属院","碧兴园","和景园","汉容家园","航南小区","宏嘉丽园","首体家属院","太阳园","盈都大厦","远大园五区",
    "烟树园","怡丽南园","晨月园","春荫园","金夕园","鲁艺上河村","垂虹园","翠叠园","观山园","世纪金源国际公寓",
    "时雨园","晴波园","晴雪园","怡丽北园","东冉家园","翰林公馆","武警22号院","黄庄小区","大泥湾","中关村发育所"
    "紫金数码","新科祥园","希格玛公寓","怡升园","理想大厦","空间物理所小区","科熙小区","航天社区","恒兴大厦","科技园小区",
    "荣上居","东南小区","科育小区","中科大厦","中科院青年公寓"
]
#街道列表
street_list = [
    "安定门街道","建国门街道", "朝阳门街道", "东直门街道", "东华门街道", "和平里街道", "北新桥街道", "交道口街道", "景山街道", "东四街道", 
    "月坛街道", "德胜街道", "新街口街道", "西长安街街道", "展览路街道", "新镇街道", "石楼镇", "拱辰街道", "西潞街道", "永顺镇", "梨园镇"]
#姓氏列表
first_name_array = [
    "李", "王", "张","刘", "陈", "杨", "赵", "黄", "周", "吴","徐", "孙", "胡", "朱", "高", "林", "何","郭", "马", "罗", "梁", "宋", "郑", "谢",
    "韩", "唐", "冯", "于", "董", "萧", "程","曹", "袁", "邓", "许", "傅", "沈", "曾","彭", "吕", "苏", "卢", "蒋", "蔡", "贾","丁", "魏", "薛",
    "叶", "阎", "余", "潘","杜", "戴", "夏", "钟", "汪", "田", "任","姜", "范", "方", "石", "姚", "谭", "廖","邹", "熊", "金", "陆", "郝", "孔",
    "白","崔", "康", "毛", "邱", "秦", "江", "史","顾", "侯", "邵", "孟", "龙", "万", "段","漕", "钱", "汤", "尹", "黎", "易", "常","武", "乔",
    "贺", "赖", "龚", "文", "司马", "上官", "欧阳", "夏侯", "诸葛", "闻人", "东方", "赫连", "皇甫", "尉迟", "公羊", "澹台", "公冶", "宗政", "濮阳", "淳于", "单于",
    "太叔", "申屠", "公孙", "仲孙", "轩辕", "令狐"
]
#名列表
last_name_array = [
    "芳", "娜", "敏","秀","雨","静", "晶", "鑫", "兰", "英", "丽", "莉", "洋", "艳",
    "燕", "娟", "霞", "平", "玲", "桂", "丹", "萍", "华", "玉", "悦", "妍", "涵", "玥", "蕊", "涵", "萱", "怡", "彤",
    "琪", "梓", "欣","子","思","一","于", "士", "工", "土", "才",  "大", "万", "小", "山", "千", 
    "川", "久", "凡",  "夕", "丸",  "广", "义", "之", "弓", "己","子",
    "强", "洋", "军", "杰", "磊", "伟", "超", "伟","韬", "涛",
    "飞", "睿", "浩", "博", "瑞", "昊","刚",
    "鹏","华","轩", "宇", "泽",
    "卫", "飞", "习", "马" "丰", "王", "井", "开", "夫", "天", "无", "元", "专", "云", "扎",
    "艺", "木", "五", "支", "不", "太", "区", "历", "尤", "友", "匹", "车", "巨", "牙", "屯", "比", "互", "切",
    "瓦", "止", "少", "日", "中", "冈", "贝", "内", "水", "见", "午", "牛", "手", "毛", "气", "升", "长", "仁", "什", "片",
    "仆", "化", "仇", "币", "仍", "仅", "斤",  "父", "从", "今", "凶", "分", "乏", "公", "仓", "月", "氏",
    "勿", "风", "丹", "匀", "乌", "凤", "勾", "文", "六", "方", "火", "为", "斗", "忆", "订", "计", "户", "认", "心",
    "尺", "引", "丑", "巴", "孔", "队", 
    "老", "执", "巩", "圾", "扩", "扫", "地", "扬", "场", "共", "芒", "亚", "芝", "朽", "朴", "机", "权", "过", "臣",
    "再", "协", "西", "压", "厌", "在", "有", "百", "存", "而", "页", "匠", "夸", "夺", "灰", "达", "列", "死", "成", "夹",
    "轨", "邪", "划", "迈", "毕", "至", "此", "贞", "师", "尘", "尖", "劣", "光", "当", "早", "吐", "吓", "虫", "曲", "团",
    "同", "因", "屿", "帆", "岁", "回", "岂", "刚",  "网", "年", "朱", "先", "丢", "舌",
    "竹", "迁", "乔", "伟", "传", "乒", "乓", "休", "伍", "伏", "优", "伐", "延", "件", "任", "伤", "价", "份", "华", "仰",
    "仿", "伙", "伪", "自", "血", "向", "似", "后", "行", "舟", "全", "会", "杀", "合", "兆", "企", "众", "爷", "伞", "创",
    "肌", "朵", "杂", "危", "旬", "旨", "负", "各", "名", "多", "争", "色", "壮", "冲", "冰", "庄", "庆", "亦", "刘", "齐",
    "交", "次", "衣", "产", "决", "充", "妄", "闭", "问", "闯", "羊", "并", "关", "米",
    "芬", "苍", "芳", "严", "芦", "劳", "克", "苏", "杆", "杠", "杜", "材", "村", "杏", "极", "李", "杨", "求", "更", "束",
    "豆", "两", "丽", "医", "辰", "励", "否", "还", "歼", "来", "连", "步", "坚", "旱", "盯", "呈", "时", "吴", "助", "县",
    "园", "旷", "围", "呀", "吨", "足", "邮", "男", "困", "吵", "串", "员", "听", "吩", "吹", "呜", "吧", "吼",
    "别", "岗", "帐", "财", "针", "钉",  "乱", "利",  "秀", "私", "每", "兵", "估", "何", "但", "伸",
    "作", "伯", "伶", 
    "幸", "招", "坡", "披", "拨", "择", "抬", "其", "取", "苦", "若", "茂", "苹", "苗", "英", "范", "直",
    "茄", "茎", "茅", "林", "枝", "杯", "柜", "析", "板", "松", "枪", "构", "杰", "述", "枕", "丧", "或", "画", "卧", "事",
    "刺", "枣", "雨", "卖", "矿", "码", "厕", "奔", "奇", "奋", "态", "欧", "垄", "妻", "轰", "顷", "转", "斩", "轮", "软",
    "尚", "旺", "具", "果", "味", "昆", "国", "昌", "畅", "明",
    "易", "昂", "典", "固", "忠", "咐", "呼", "鸣", "咏",  "岸", "岩", "帖", "罗", "帜", "岭", "凯", "败", "贩", "购",
    "图", "钓", "制", "知", "垂", "牧", "物", "乖", "刮", "秆", "和", "季", "委", "佳", "侍", "供", "使", "例", "版", "侄",
    "侦", "侧", "凭", "侨", "佩",  "依", "迫", "质", "欣", "征", "往", "爬", "彼", "径", "所", "舍", "金", "命",
    "采", "念", "朋", "股", "周",
    "忽", 
    "草", "茧", "茶", "茫", "荣", "故", "胡", "南", "药", "标", "枯", "柄", "栋", "相", "查", "柏", "柳", "柱",
    "柿", "栏", "树", "要", "咸", "威", "歪", "研", "砖", "厘", "厚", "砌", "砍", "面", "耐", "耍", "牵", "残", "殃", "轻",
    "鸦", "皆", "背", "战", "点", "临", "览", "竖", "省", "削", "尝", "是", "盼", "眨", "哄", "显", "哑", "冒", "映", "星",
     "贵", "界", "虹", 
    "配", "夏", "础", 
    "容", "宰", "案", "请", "朗", "诸", "读", "扇", "袜", "袖", "袍", "被", "祥", "课", "谁", "调", "冤", "谅", "谈", "谊",
    "恳", "展", "剧", "屑", "弱", "陵", "陶", "陷", "陪", "娱", "娘", "通", "能", "难", "预", "桑", "绢", "绣", "验",
    "继", "球", "理", "捧", "堵", "描", "域", "掩", "捷", "排", "掉", "堆", "推", "掀", "授", "教", "掏", "掠", "培", "接",
    "控", "探", "据", "掘", "职", "基", "著", "勒", "黄", "萌", "萝", "菌", "菜", "萄", "菊", "萍", "菠", "营", "械", "梦",
    "梢", "梅", "检", "梳", "梯", "桶", "救", "副", "票", "戚", "爽", "聋", "袭", 
    "蒜", "勤", "鹊", "蓝", "墓", "幕", "蓬", "蓄", "蒙", "蒸", "献", "禁", "楚", "想", "槐", "榆", "楼", "概", "赖", "酬",
    "感", "碍", "碑", "碎", "碰", "碗", "碌", "雷", "零", "雾", "雹", "输", "督", "龄", "鉴", "睛", "睡", "睬", "鄙", "愚",
    "暖", "盟", "歇", "暗", "照", "路", "跟", "蛾", "蜂", "嗓", "置","罩", "错", "锡", "锣",
    "锤", "锦", "键", "锯", "矮", "辞", "稠", "愁", "筹", "签", "简", "微", "愈",
    "遥", "腾", "解", "廉", "新", "韵", "意", "粮", "数",  "慈",
    "煌", "满", "漠", "源", "滔", "箭", "篇",
    "德", "艘", "膝", "膛", "熟", "摩", "颜", "毅", "糊", "遵", "潜", "潮",
    "燕", "薄", "橘","融", "器", "赠", "默", "镜", "赞", "篮", "邀", "衡",
    "糖", "糕", "燃","戴", "鞠", "霜",
    "霞", "穗", "繁",  "赢",  "翼", "镰", "鹰",
    "疆", "壤", "耀", "魔", "霸", "露"
]
"""
array length
"""
first_name_size = first_name_array.__len__()
last_name_size = last_name_array.__len__()
#生成姓名
def fullname():
    """
    获取一个随机名，名的长度1或2
    :return:
    """
    first_name = first_name_array[random.randint(0, first_name_size-1)]
    last_name = ''.join(last_name_array[random.randint(0, last_name_size-1)] for i in range(random.randint(1, 2)))
    return first_name + last_name
#生成联系方式
def creat_phone():
    # 第二位
    second = [3,4,5,7,8][random.randint(0,4)]
    
    # 第三位的值根据第二位来确定
    third = {
        3:random.randint(0,9),
        4:[5,7,9][random.randint(0,2)],
        5:[i for i in range(10) if i!=4][random.randint(0,8)], 
        7:[i for i in range(10) if i not in [4,9]][random.randint(0,7)],
        8:random.randint(0,9)
    }[second]
    # 后8位随机抽取
    suffix = ''
    for x in range(8):
        suffix = suffix + str(random.randint(0,9))
    # 拼接
    return "1{}{}{}".format(second,third,suffix)
#生成性别
def create_sex():
    sex = random.choice('男女')
    return sex
#生成核酸检测结果
def create_result():
    result = random.choice(['阴性','阳性'])
    return result
#生成检测ID
def create_testID():
    first=str(random.randint(1, 9))
    test=''.join(random.sample(string.digits, 9))
    testID=first+test
    return testID
#生成出生日期和身份证号
def create_bdy_ID():
    birthday=radar.random_date("1940-01-01", "2022-12-11")
    #print(birthday)
    temp=birthday.strftime('%Y-%m-%d %H:%M:%S')
    middle=temp[:4]+temp[5:7]+temp[8:10]
    #print(middle)
    first=str(random.randint(1, 9))
    front=''.join(random.sample(string.digits, 5))
    end=''.join(random.sample(string.digits, 4))
    ID=first+front+middle+end

    return birthday,ID
#生成日期时间
def create_datetime():
    datetime=radar.random_datetime("2022-01-01T00:00:00", "2022-12-11T23:59:59")
    return datetime
#生成出入日期
def create_two_date():
    enterdate=radar.random_date("2022-01-01", "2022-12-11")
    temp=radar.random_date(enterdate,"2022-12-11")
    outdate=random.choice([temp,None])
    return enterdate,outdate
#生成街道
def create_street():
    street=random.choice(street_list)
    return street

#生成完整数据并写入csv
def create_info():
    with open('residence_info.csv','w',newline='') as f1:
        csvwriter1 = csv.writer(f1)
        #print(f1)
        list=['ID','name','tele_number','sex','birthday','community','enterdate','outdate']
        csvwriter1.writerow(list)

    with open('test_result.csv','w',newline='') as f2:
        csvwriter2 = csv.writer(f2)
        csvwriter2.writerow(['ID','test_time','result','test_ID'])

    with open('scan_info.csv','w',newline='') as f3:
        csvwriter3 = csv.writer(f3)
        csvwriter3.writerow(['Place_ID','ID','enter_time'])

    for i in range(10000):
    #residence_info
        birthday,ID=create_bdy_ID()
        name=fullname()
        tele_number=creat_phone()
        sex = create_sex()
        enterdate,outdate = create_two_date()
        with open('residence_info.csv','a',newline='') as f1:
            csvwriter1 = csv.writer(f1)
            csvwriter1.writerow([ID,name,tele_number,sex,birthday,None,enterdate,outdate])
        #test_result
        r1=random.randint(0,5)
        with open('test_result.csv','a',newline='') as f2:
            csvwriter2 = csv.writer(f2)
            for i in range(r1):
                testtime=create_datetime()
                result= create_result()
                testID=create_testID()
                csvwriter2.writerow([ID,testtime,result,testID])
        #scan_code_info
        r2=random.randint(0,5)
        with open('scan_info.csv','a',newline='') as f3:
            csvwriter3 = csv.writer(f3)
            for i in range(r2):
                entertime=create_datetime()
                csvwriter3.writerow([None,ID,entertime])
#插入居民的居住地
def insert_community():
    i=0
    with open('out.csv', 'w', newline="") as f:# output csv file
        writer = csv.writer(f)
        with open('residence_info.csv','r') as csvfile: # input csv file
            reader = csv.reader(csvfile, delimiter=',')
            j=1
            for row in reader:  
                row[5] = community_list[i] 
                writer.writerow(row)
                j=j+1
                if j==10 :
                    j=1
                    i=i+1
                    if i==len(community_list):
                        i=0
#插入扫码信息中的场所ID
def insert_community_ID():
    i=0
    with open('out2.csv', 'w', newline="") as f:# output csv file
        writer = csv.writer(f)
        with open('scan_info.csv','r') as csvfile: # input csv file
            reader = csv.reader(csvfile, delimiter=',')
            j=1
            for row in reader:  
                row[0] = community_ID_list[i] # edit the 8th column 
                writer.writerow(row)
                j=j+1
                if j==10 :
                    j=1
                    i=i+1
                    if i==len(community_ID_list):
                        i=0
#插入场所信息中的manager和联系方式
def insert_name_phone():
    with open('out3.csv','w',newline="") as f:
        writer = csv.writer(f)
        with open('community_info.csv','r') as csvfile:
            reader = csv.reader(csvfile, delimiter=',')
            for row in reader:
                row[3]=fullname()
                row[4]=creat_phone()
                writer.writerow(row)

""" create_info()
insert_community()
insert_community_ID()
insert_name_phone() """
